Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Result
Classes
FemElement
Provides information about FEM element
ListOfResultOfMember
List of result of member
Loading
Loading identification
Member
Member identification
MeshElement2D
Element2D
OpenModelResult
Results of open model
PlateElements
Data of plate elements
PointOfID
Point of interaction diagram
PointResultBase
Point Result Base abstract class
PointResultOfNLA
Point Result of NLA
PointResultOfTA
Point Result of TA
PointResults
Point results
PolygonPointID
Polygon of pointIDs
ResultBase
Result base abstract class
ResultInSection
Common result
ResultOfDeformation
Result of deformation in the one positon
ResultOfDeformation2
Result of deformation in the one positon
ResultOfIncrement
Result of internal forces in the one position
ResultOfIncrement2
Result of internal forces in the one position
ResultOfInteractionDiagramPlane
Result of Interaction diagram in plane
ResultOfInternalForces
Result of internal forces in the one position
ResultOfInternalForces2
Result of internal forces in the one position
ResultOfLoading
Result Of Loading
ResultOfLoading2
Result of internal forces in the one position
ResultOfLoadingItem
Item of Result of Loading
ResultOfMember2
Result of the member
ResultOfNLA
Result of internal forces in the one position
ResultOfNLA2
Result of internal forces in the one position
ResultOfNLAPoint
Result of internal forces in the one position
ResultOfNLAPoint2
Result of internal forces in the one position
ResultOfNLASection
Result of internal forces in the one position
ResultOnMember
Result of the member
ResultOnMembers
Result of the member
ResultOnMembers2
Result of member
ResultOnMesh
ResultOnSection
Result of section on the member
ResultPoint
Point of results
SectionResultBase
Section result base
SectionResultMesh
Section result mesh
SectionResultOnPoints
Section result of points
Enums
AbsoluteRelative
Absolute of relative value of position is used
LoadingType
Type of loading
MemberType
Type of member
ResultLocalSystemType
Type of local system of result
ResultOnMeshType
Type of result on mesh
ResultType
Type of results
StructuralPlateType
Tyoe of structural plate